Repository: doc-autoit-fr/omegat
Catalog: tm/auto/AutoItFr_201503.tmx
Source language: en
Languages: fr

source: Holds the left Windows key down until {LWINUP} is sent
fr: Maintient appuyé la touche Windows de gauche jusqu'à l'envoi de la touche {LWINUP}

source: Holds the right Windows key down until {RWINUP} is sent
fr: Maintient appuyé la touche Windows de droite jusqu'à l'envoi de la touche {RWINUP}

source: Send the ALT+nnnn key combination
fr: Envoi la combinaison ALT+nnnn

source: Select the browser "back" button
fr: Sélectionne le bouton "Arrière" du navigateur

source: Select the browser "forward" button
fr: Sélectionne le bouton "Avant" du navigateur

source: Select the browser "refresh" button
fr: Sélectionne le bouton "actualiser" du navigateur

source: Select the browser "stop" button
fr: Sélectionne le bouton "stop" du navigateur

source: Select the browser "search" button
fr: Sélectionne le bouton "recherche" du navigateur

source: Select the browser "favorites" button
fr: Sélectionne le bouton "favoris" du navigateur

source: Launch the browser and go to the home page
fr: Lance le navigateur internet sur la page d'accueil

source: Mute the volume
fr: Coupe le son

source: Reduce the volume
fr: Réduit le volume du son

source: Increase the volume
fr: Augmente le volume du son

source: Select next track in media player
fr: Sélectionne la prochaine piste dans le lecteur Media Player

source: Select previous track in media player
fr: Sélectionne la piste précédente dans le lecteur Media Player

source: Stop media player
fr: Arrête la musique du lecteur Média Player

source: Play/pause media player
fr: Met en pause/marche le son dans le lecteur Média Player

source: Launch the email application
fr: Lance la messagerie Internet

source: Launch media player
fr: Lance le lecteur Média Player

source: Launch user app1
fr: Lance l'application 1 définie par l'utilisateur

source: Launch user app2
fr: Lance l'application 2 définie par l'utilisateur

source: To send the ASCII value A (same as pressing ALT+065 on the numeric keypad)
fr: Pour envoyer la valeur ASCII de A (identique à l'appui de ALT+065 sur le pavé numérique)

source: (When using 2 digit ASCII codes you must use a leading 0, otherwise an obsolete 437 code page is used).
fr: (Quand vous devez utiliser un codes ASCII à deux chiffres, vous devez mettre un 0 devant, sinon le code de page obsolète 437 est utilisé).

source: To send UNICODE characters enter the character code (decimal or hex), for example this sends a Chinese character
fr: Pour envoyer des caractères UNICODE, entrez le code des caractères (décimal ou hexadécimal), par exemple pour envoyer un caractère chinois.

source: Send("{ASC 2709}") or Send("{ASC 0xA95}")
fr: Send("{ASC 2709}") ou Send("{ASC 0xA95}")

source: Single keys can also be sent repeated:
fr: Des touches seules peuvent aussi être répétées, comme dans les exemples ci-dessous.

source: Send("{DEL 4}") ;Presses the DEL key 4 times
fr: Send("{DEL 4}") ; Envoyer la touche DEL 4 fois

source: Send("{S 30}") ;Sends 30 'S' characters
fr: Send("{S 30}") ; Envoyer 30 fois le caractère 'S'

source: Send("+{TAB 4}") ;Presses SHIFT+TAB 4 times
fr: Send("+{TAB 4}") ; Appuyer 4 fois sur SHIFT+TAB

source: No key is sent if the count is zero allowing the count to be set programatically:
fr: Aucune touche n'est envoyée si le nombre est 0, ce qui permet de définir ce nombre par programme:

source: Send("{M " & $iCount & "}") ;Presses the M key as many times as set in the $iCount variable
fr: Send("{M " & $iCount & "}") ;Presse la touche M plusieurs fois suivant le contenu de la variable $iCount.

source: To hold a key down
fr: Pour laisser une touche appuyée (généralement utile pour les jeux)

source: Send("{a down}") ;Holds the A key down
fr: Send("{a down}") ; Laisse la touche 'A' appuyée

source: Send("{a up}") ;Releases the A key
fr: Send("{a up}") ; Libère la touche 'A'

source: To set the state of the capslock, numlock and scrolllock keys
fr: Pour fixer l'état des touches 'Verrouillage Majuscule', 'Verrouillage Pavé numérique' et 'Arrêt défilement' :

source: Send("{NumLock on}") ;Turns the NumLock key on
fr: Send("{NumLock on}") ; Change l'état du pavé numérique (NumLock) en On

source: Send("{CapsLock off}") ;Turns the CapsLock key off
fr: Send("{CapsLock off}") ; Change l'état des majuscule (CapsLock) en Off

source: Send("{ScrollLock toggle}") ;Toggles the state of ScrollLock
fr: Send("{ScrollLock toggle}") ; Bascule l'état de l'arrêt défilement (ScrollLock)

source: If you wish to use a variable for the count, try
fr: Si vous souhaitez utiliser une variable pour le nombre de répétition, essayez

source: If you wish to send the ASCII value A four times, then try
fr: Si vous souhaitez envoyer la valeur ASCII 'A' 4 fois, essayez

source: Most laptop computer keyboards have a special Fn key.
fr: La plupart des ordinateurs portable possèdent une touche spéciale Fn.

source: This key cannot be simulated.
fr: Cette touche ne peut être simulée.

source: Note, by setting the flag parameter to 1 the above "special" processing will be disabled.
fr: Remarque:En fixant le paramètre à 1 les combinaisons 'spéciales' qui suivent seront désactivés.

source: This is useful when you want to send some text copied from a variable and you want the text sent exactly as written.
fr: Ce paramètre est très utile quand vous voulez envoyer un texte copié d'une variable et que vous voulez envoyer le texte exactement comme il est écrit.

source: For example, open Folder Options (in the control panel) and try the following:
fr: Par exemple, dans le panneau de configuration, ouvrez 'Options des dossiers' et essayez ce qui suit :

source: Navigate to next control (button, checkbox, etc)
fr: Navigue au contrôle suivant (button, checkbox, etc)

source: Navigate to previous control.
fr: Navigue au contrôle précédent.

source: Navigate to next WindowTab (on a Tabbed dialog window)
fr: Navigue à l'onglet suivant (fenêtre de dialogue à onglet)

source: Navigate to previous WindowTab.
fr: Navigue à l'onglet précédent.

source: Can be used to toggle a checkbox or click a button.
fr: Peut être utilisé pour commuter un 'checkbox' ou cliquer un 'button'.

source: Usually checks a checkbox (if it's a "real" checkbox.)
fr: Typiquement, coche un 'checkbox' (si il est un "réel" checkbox.)

source: Usually unchecks a checkbox.
fr: Typiquement, décoche un 'checkbox'.

source: Recursively expands folders in a SysTreeView32.
fr: Développe récursivement les répertoires d'un 'SysTreeView32'.

source: Use Alt-key combos to access menu items.
fr: Utilisez les 'combos' avec Alt-touche pour accéder aux items du menu.

source: Also, open Notepad and try the following:
fr: Vous pouvez également ouvrir le bloc-notes et tester ceci :

source: Send("!f") Send() Alt+f, the access key for Notepad's file menu.
fr: Send("!f") Send() Alt+f, la touche d'accès au menu 'Fichier' du Bloc-notes.

source: Try other letters!
fr: Essayez d'autres lettres!

source: Move down a menu.
fr: Descend dans le menu.

source: Move up a menu.
fr: Monte dans le menu.

source: Move leftward to new menu or expand a submenu.
fr: Va vers la gauche vers un nouveau menu ou développe un sous-menu.

source: Move rightward to new menu or collapse a submenu.
fr: Va vers la droite vers un nouveau menu ou réduit un sous-menu.

source: See Windows' Help--press Win+F1--for a complete list of keyboard shortcuts if you don't know the importance of Alt+F4, PrintScreen, Ctrl+C, and so on.
fr: Consultez l'aide de Windows en appuyant sur Win+F1 pour une liste complète des raccourcis claviers si vous ne connaissez pas l'importance de Alt + F4, 'Imp Écran', Ctrl+C, et d'autres encore.

source: When running a script on a remote computer through a program as psexec (www.sysinternals.com) or beyondexec (www.beyondlogic.org) it is necessary, specially when sending strokes to a program launch by the script with a Run() function, to use ControlSend() or other ControlXXX functions to directly communicate with the control.
fr: Quand un script est lancé sur un ordinateur distant à travers un programme tiers comme psexec (www.sysinternals.com) ou beyondexec (www.beyondlogic.org), il est nécessaire, spécialement en envoyant des touches à un programme lancé par le script via la fonction Run(), d'utiliser ControlSend() ou d'autres fonctions ControlXXX pour communiquer directement avec le contrôle.

source: Send() even with Opt("SendAttachMode", 1) will not work.
fr: Send() même avec Opt("SendAttachMode", 1) ne fonctionnera pas.

source: Using the -s mode when submitting can help to have better rights on the remote computer.
fr: Utilisez le mode -s quand vous envoyez des touches peut vous aider à avoir des meilleurs droits sur l'ordinateur distant.

source: Opt("SendKeyDelay",...) alters the the length of the brief pause in between sent keystrokes.
fr: Opt("SendKeyDelay",...)change la longueur de la pause entre les touches consécutives.

source: Set both "SendKeyDelay" and "SendKeyDownDelay" to 0 to remove all delays when sending keystrokes.
fr: Définissez "SendKeyDelay" et "SendKeyDownDelay" à 0 pour enlever tous les délais lors de l'envoi de touches.

source: This may be required under certain circumstances, for example, when locking the system ("#l") it may be necessary to remove the delays in order to prevent the WIN key from being stuck down.
fr: Cela peut être nécessaire dans certaines circonstances, par exemple, lors du verrouillage du ...système ("#L"), il peut être nécessaire d'enlever les délais afin de prévenir que la touche WIN reste enfoncée.

source: Simulate the key combination Win + R to open the Run dialogue window.
fr: Simuler la combinaison de touches Win + R pour ouvrir la fenêtre de dialogue Exécuter.

source: Wait 10 seconds for the Run dialogue window to appear.
fr: Attend 10 secondes que la fenêtre de dialogue Exécuter apparaît.

source: Simulate entering notepad.exe and pressing the 'ENTER' key.
fr: Simule une entrée dans notepad.exe et presse la touche 'ENTER'.

source: Simulate entering the following string and pressing the 'F5' key to input the date and time into edit control of Notepad.
fr: Simuler l'entrée de la chaîne suivante et appuie sur la touche "F5" pour entrer la date et l'heure dans le contrôle d'édition du bloc-notes.

source: The title/hWnd/class of the window to activate.
fr: Le titre/hWnd/classe de la fenêtre à activer.

source: Use a blank title to disable the function.
fr: Utilisez un titre vide pour désactiver la fonction.

source: The text of the window.
fr: Le texte de la fenêtre.

source: .Default is an empty string.
fr: Par défaut est une chaîne vide.

source: 0 if window is not found.
fr: Retourne 0 si la fenêtre n'est pas trouvée.

source: Using SendKeepActive("") attempts to reset the active window in between each simulated keystroke from Send().
fr: Utilisation SendKeepActive("") tente de réinitialiser la fenêtre active entre chaque simulation de touche avec Send() .

source: Keep the Notepad window active when using the Send function.
fr: Garde la fenêtre du Bloc-notes active lorsque vous utilisez la fonction Send().

source: Simulate entering a string of text.
fr: Simule l'entrée d'une chaîne de texte.

source: If you try to change to a different window other than Notepad, then the Notepad window will
fr: Si vous essayez de passer à une autre fenêtre que le Bloc-notes, alors la fenêtre du Bloc-notes

source: be brought to focus again.
fr: récupèrera le focus de nouveau.

source: Disable the Notepad window being active when using the Send function.
fr: Désactive la fenêtre du Bloc-notes qui est active lorsque vous utilisez la fonction Send().

source: SendMessage user defined functions Reference
fr: SendMessage - Référence

source: When using them you need to add a #include <SendMessage.au3>.
fr: Pour les utiliser, vous aurez besoin d'ajouter #include <SendMessage.au3>.

source: Manually set the value of the @error (and optionally @extended) macro.
fr: Définit manuellement la valeur de la macro @error (et optionnellement la macro @extended).

source: The required value (integer) to set into the @error macro.
fr: La valeur requise (entière) pour définir la macro @error.

source: The required value (integer) to set into the @extended macro.
fr: La valeur optionnelle (entière) pour définir la macro @extended.

source: This sets the same macro as the SetExtended() function.
fr: Ceci définit la même macro que la fonction SetExtended().

source: The value to be returned by the function - if no parameter used the return value is undefined.
fr: La valeur qui sera retournée par la fonction - si aucun paramètre n'est utilisé la valeur de retour est indéfinie.

source: Returns the "return value" parameter (undefined if the parameter is not used).
fr: Retourne le paramètre "valeur de retour" (indéfinie si le paramètre n'est pas utilisé).

source: @error and @extended will be set to the values set in the function call (both default = 0)
fr: @error et @extended seront définies avec les valeurs installées dans l'appel de la fonction (les deux, par défaut = 0).

source: When entering a function @error is set to 0.
fr: Lorsque vous entrez dans une fonction, @error est remis à 0.

source: Unless SetError() is called, then @error will remain 0 when the function ends.
fr: A moins que SetError() ne soit appelée, @error restera à 0 à la sortie de la fonction.

source: This means that in order for @error to be set after a function, it must be explicitly set.
fr: Cela signifie que vous devez assigner explicitement @error à la sortie d'une fonction, il doit être explicitement défini.

source: This also means you may need to backup the status of @error in a variable if you are testing it in a While-WEnd loop.
fr: Cela signifie également que vous pouvez avoir besoin de sauvegarder le statut de @error dans une variable si vous la testez dans une boucle While-WEnd.

source: The extended parameter is optional.
fr: Le paramètre extended est optionnel.

source: It is provided as a way to set both @error and @extended at the same time.
fr: Il est seulement prévu comme un moyen de définir à la fois @error et @extended au même moment.

source: If only @extended needs set, then it is recommended to use the SetExtended() function instead.
fr: Si vous avez seulement besoin de définir @extended, alors il est recommandé d'utiliser la fonction SetExtended() à la place.

source: @error is limited between the values of -2147483648 to 2147483647.
fr: @error est limitée entre les valeurs de -2147483648 à 2147483647.

source: Indeterminate form 0/0.
fr: Forme indéterminée 0/0.

source: Plain division by zero.
fr: Division par zéro plaine.

source: Display the return value, @error and @extended value.
fr: Affiche la valeur de retour, @error et @extended.

source: Set @error to 3, @extended to 10 and return the string "Some return value."
fr: Régle @error à 3, @extended à 10 et renvoie la chaîne "Quelques valeurs de retour.\"

source: Manually set the value of the @extended macro.
fr: Définit manuellement la valeur de la macro @extended.

source: @extended will be set to the values set in the function call (default = 0)
fr: @extended sera définie avec les valeurs définies dans l'appel de la fonction (par défaut = 0 )

source: When entering a function @extended is set to 0.
fr: Lors de l'entrée dans une fonction, @extended est définie à 0.

source: Unless SetExtended() is called, then @extended will remain 0 when the function ends.
fr: A moins que SetExtended() soit appelée, alors @extended restera 0 lorsque la fonction se terminera.

source: This means that in order for @extended to be set after a function returns, it must be explicitly set in the function.
fr: Cela signifie que, @extended doit être définie après qu'une fonction retourne, elle doit être définie explicitement dans la fonction.

source: This also means you may need to backup the status of @extended in a variable if you are testing it in a While-WEnd loop.
fr: Cela signifie également que vous pouvez avoir besoin de sauvegarder le statut de @extended dans une variable si vous la testez dans une boucle While- WEnd.

source: @extended is limited between the values of -2147483648 to 2147483647.
fr: @extended est limitée entre les valeurs de -2147483648 à 2147483647.

source: Runs an external program using the ShellExecute API.
fr: Exécute un programme externe en utilisant l'API ShellExecute.

source: The name of the file to run (EXE, .txt, .lnk, etc).
fr: Le nom du fichier à exécuter (EXE, .txt, .lnk, etc..).

source: Any parameters for the program.
fr: Les paramètres du programme.

source: Blank ("") uses none.
fr: Vide ("") si aucun.

source: The "verb" to use, common verbs include:
fr: Le "verbe" à utiliser, verbes courants comprennent:

source: open = Opens the file specified.
fr: open = Ouvre le fichier spécifié.

source: The file can be an executable file, a document file, or a folder
fr: Le fichier peut être un fichier exécutable, un fichier document ou un dossier

source: edit = Launches an editor and opens the document for editing.
fr: edit = lance un éditeur et ouvre le document pour l'éditer.

source: If "filename" is not a document file, the function will fail
fr: Si "filename" n'est pas un fichier de document, la fonction échouera

source: print = Prints the document file specified.
fr: print = Imprime le fichier de document spécifié.

source: properties = Displays the file or folder's properties
fr: properties = Affiche le fichier ou les propriétés de dossier

source: See remarks for more information on the default behavior when a verb is not specified.
fr: Voir remarques pour plus d'information sur le comportement par défaut quand 'verb' n'est pas spécifié.

source: @SW_HIDE = Hidden window
fr: @SW_HIDE = Fenêtre cachée

source: Or -1 if there was no PID available.
fr: Ou -1 si il n'y avait pas de PID disponible.

source: To pause execution of the script until the spawned program has finished use the ShellExecuteWait() function instead.
fr: Pour mettre en pause l'exécution du script jusqu'à ce que le programme soit terminé, utilisez la fonction ShellExecuteWait() à la place.

source: When no verb is specified the default verb is used.
fr: Lorsque aucun verbe n'est spécifié, le verbe est utilisé par défaut.

source: The default verb is the verb configured in the registry.
fr: Le verbe par défaut est le verbe configuré dans le Registre.

source: If no verb is set as default in the registry then the "open" verb is used.
fr: Si aucun verbe n'est défini par défaut dans le Registre, alors le verbe "open" est utilisé.

source: If the "open" verb is not present then the first verb listed in the registry is used.
fr: Si le verbe "open" n'est pas présent, alors le premier verbe inscrit au registre est utilisé.

source: Retrieve the following text file.
fr: Récupére le fichier texte suivant.

source: This can be found in the include folder which is in the installation path of AutoIt.
fr: Il peut être trouvé dans le dossier 'include' dans le chemin d'installation de AutoIt.

source: Execute the readme file (.txt) with the default editor used for text files in Windows.
fr: Exécute le fichier readme (txt) avec l'éditeur utilisé par défaut pour les fichiers texte sous Windows.

source: Runs an external program using the ShellExecute API and pauses script execution until it finishes.
fr: Exécute un programme externe en utilisant l'API ShellExecute et interrompt l'exécution du script jusqu'à ce qu'il se termine.

source: After running the requested program the script pauses until the requested program terminates
fr: Après avoir exécuté le programme demandé le script s'interrompt jusqu'à ce que le programme demandé termine

source: Execute Notepad and wait for the Notepad process to close.
fr: Exécute le Bloc-notes et attend que le processus du Bloc-notes se termine.

source: Shuts down the system.
fr: Arrête le système.

source: A combination of shutdown codes.
fr: Une combinaison des codes d'arrêt.

source: See "remarks".
fr: Voir "Remarques".

source: 0 and sets the @error flag to Windows API GetLastError().
fr: Retourne 0 et affecte @error avec l'API Windows GetLastError().

source: The shutdown code is a combination of the following values:
fr: Le code d'arrêt est une combinaison des valeurs suivantes.

source: $SD_LOGOFF (0) = Logoff
fr: $SD_LOGOFF (0) = Ferme la session

source: $SD_SHUTDOWN (1) = Shutdown
fr: $SD_SHUTDOWN (1) = Arrêt

source: $SD_FORCE (4) = Force
fr: $SD_FORCE (4) = Force l'arrêt des applications

source: $SD_POWERDOWN (8) = Power down
fr: $SD_POWERDOWN (8) = Mise hors tension

source: $SD_FORCEHUNG (16) = Force if hung
fr: $SD_FORCEHUNG (16)= Force l'arrêt même si une application ne répond pas

source: $SD_STANDBY (32) = Standby
fr: $SD_STANDBY (32)= Mise en veille

source: $SD_HIBERNATE (64) = Hibernate
fr: $SD_HIBERNATE (64) = Mise en veille prolongée

source: Required values should be BitOR()'ed together.
fr: Les valeurs requises peuvent être combinées avec BitOR().

source: To shutdown and power down, for example, the code would be BitOR($SD_SHUTDOWN, $SD_POWERDOWN).
fr: Pour l'arrêt et la mise hors tension, par exemple, le code serait BitOR($SD_SHUTDOWN, $SD_POWERDOWN).

source: Standby or Hibernate are ignored if other codes are set.
fr: La Veille ou la Veille prolongée sont ignorées si d'autres codes sont définis.

source: Force a reboot
fr: Forcer un redémarrage

source: Calculates the sine of a number.
fr: Calcule le sinus d'un nombre.

source: Returns the trigonometric sine of the number.
fr: Retourne le sinus trigonométrique du nombre.

source: Assign a Local variable the sine of PI / 4 (equals to Sqrt(2) / 2).
fr: Assigne une variable locale avec le sinus de PI / 4 (égal à sqrt (2) / 2).

source: Assign a Local variable the sine of 90 degrees (firstly converted to radians).
fr: Assigne une variable locale avec le sinus de 90 degrés (d'abord converti en radians).

source: Sound user defined functions Reference
fr: Sound - Référence

source: When using them you need to add a #include <Sound.au3>.
fr: Pour les utiliser, vous aurez besoin d'ajouter #include <Sound.au3>.

source: Name of the file to be played (typically a WAV or MP3)
fr: Nom du fichier à jouer (généralement un fichier WAV ou MP3)

source: This flag determines if the script should wait for the sound to finish before continuing:
fr: Cet indicateur détermine si le script doit attendre que le son soit fini avant de poursuivre :

source: 1 = wait until sound has finished
fr: 1 = attendre jusqu'à ce que le son soit terminé

source: 0 = continue script while sound is playing (default)
fr: 0 = continue le script tant que le son est joué (par défaut)

source: (Always returns 1 regardless of success.)
fr: (Retourne toujours 1 quel que soit le résultat.)

source: Terminating the script will stop the sound (if it is still playing).
fr: La fermeture du script stoppera le son (s'il est encore joué).

source: Calling SoundPlay("") can be used to stop a currently playing sound.
fr: L'appel à SoundPlay("") peut être utilisé pour arrêter un son en cours de lecture.

source: This has the side effect of also closing the open handle.
fr: Ceci à pour effet secondaire de fermer le handle ouvert.

source: If you need to delete a sound file which you have played in the script, you should call SoundPlay("") first to ensure the handle is closed.
fr: Si vous avez besoin de supprimer un fichier audio que vous avez joué dans le script, vous devez utiliser SoundPlay("") en premier afin d'être sûr que le handle soit fermé.

source: percentage number between 0 and 100
fr: nombre en pourcentage entre 0 et 100

source: 0 and sets the @error flag to 1 if percent is invalid.
fr: Retourne 0 et @error = 1 si pourcent est invalide.

source: This controls the Wave volume, not the master volume control.
fr: Cette fonction contrôle le volume du son, pas le contrrôle du volume maître.
